app/views/dishes/result.html.erb


  <% main_category = @dish.categories.find_by(name: ['ガッツリ', 'サッパリ']) %>
---
SELECT "categories".* FROM "categories" INNER JOIN "category_contents" ON "categories"."id" = "category_contents"."category_id" WHERE "category_contents"."dish_id" = 5 AND "categories"."name" IN ('ガッツリ', 'サッパリ') LIMIT 1

  <p>
    <% @dish.category_contents.includes(:category).where(label: "時間帯").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (4, 5)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 82 AND "category_contents"."label" = '時間帯'

  <p>
    <% @dish.category_contents.includes(:category).where(label: "季節").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (7, 9, 10)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 82 AND "category_contents"."label" = '季節'

  <p>
    <% @dish.category_contents.includes(:category).where(label: "気分詳細").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (11, 12)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 82 AND "category_contents"."label" = '気分詳細'

  <p>
    <% @dish.category_contents.includes(:category).where(label: "ジャンル").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (12, 15)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 73 AND "category_contents"."label" = '気分詳細'

  <p>
    <% @dish.category_contents.includes(:category).where(label: "調理スタイル").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (22, 23)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 82 AND "category_contents"."label" = '調理スタイル'

  <p>
    <% @dish.category_contents.includes(:category).where(label: "ヘルシーさ").each do |cc| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (22, 23)
SELECT "category_contents".* FROM "category_contents" WHERE "category_contents"."dish_id" = 5 AND "category_contents"."label" = '調理スタイル'