app/models/dish.rb

  scope :by_category, ->(category_name) {
    joins(:categories).where(categories: { name: category_name })
---
SELECT "dishes".* FROM "dishes" INNER JOIN "category_contents" ON "category_contents"."dish_id" = "dishes"."id" INNER JOIN "categories" ON "categories"."id" = "category_contents"."category_id" WHERE "categories"."name" = 'さっぱり' ORDER BY RANDOM() LIMIT 1